Repository: shimsw20/theorem_proving_in_lean4
Catalog: locale/kr/kr-level2.tmx
Source language: en_us
Languages: ko

source: What makes this a mutual definition is that even is defined recursively in terms of odd, while odd is defined recursively in terms of even.
ko: 이를 상호적인 정의로 만드는 것은 even이odd에 대해 재귀적으로 정의되었고, 한편 odd는 even에 대해 재귀적으로 정의되었다는 점이다.

source: What makes type class inference powerful is that one can chain instances.
ko: 유형 클래스 추론을 강력하게 만드는 것은 chain 개체입니다.

source: What type should cons have?
ko: cons는 어떤 유형을 가져야 할까요?

source: When Lean starts, it automatically imports the contents of the library Init folder, which includes a number of fundamental definitions and constructions.
ko: 린이 시작될 때, 이는 자동적으로 라이브러리 Init 폴더의 내용을 불러옵니다. 여기에는 다수의 기초적인 정의와 구성이 포함되어 있습니다.

source: When β doesn't depend on a, (a : α) → β is no different from the type α → β.
ko: β가 a에 의존하지 않을 때, (a : α) → β는 유형 α → β유형과 다르지 않습니다.

source: When Lean processes the header of a declaration, any unbound identifier is automatically added as an implicit argument if it is a single lower case or greek letter.
ko: 린이 선언의 헤더를 처리할 때 만약 이것이 한 글자의 소문자나 그리스 문자이면 임의의 구속되지 않은 식별자가 자동적으로 암시적인 매개변수로 추가됩니다.

source: When a function takes an argument that can generally be inferred from context, Lean allows you to specify that this argument should, by default, be left implicit.
ko: 함수가 일반적으로 맥락으로부터 추론할 수 있는 인수를 받을 때, Lean은 여러분이 이런 인수가 암시적이어야 함을 명시하도록 기본적으로 허용합니다.

source: When a type class has multiple parameters, you can mark some of them as output parameters.
ko: 유형 클래스가 다수의 매개변수를 가질 때, 여러분은 출력 매개변수로 그들 중 몇을 표시할 수 있습니다.

source: When an instance is declared, it is assigned a default priority value.
ko: 개체가 선언되면 기본 우선 순위 값이 할당됩니다.

source: When combined with the auto bound implicits feature, you can simplify the declare further and write:
ko: 암시적인 자동 결합(auto bound implicits) 기능과 결합할 때 여러분은 선언을 더 단순화 해 작성할 수 있습니다.

source: When declared in this way, a variable stays in scope until the end of the file you are working on.
ko: 이 방식으로 선언되었을 때, 변수는 여러분이 작업하는 파일 끝까지를 범위로 가질 겁니다.

source: When declaring an inductive datatype, you can use deriving Repr to instruct Lean to generate a fuction that converts Weekday objects into text.
ko: 유도 데이터형을 선언할 때, 여러분은 린에게 Weekday의 대상을 텍스트로 바꾸는 함수를 생성하라고 지시하도록 deriving Repr을 사용할 수 있습니다.

source: When implementing this definition, the equation compiler starts with a case distinction as to whether the first argument is 0 or of the form n+1.
ko: 이 정의를 구현할 때 방정식 컴파일러는 첫 번째 인수가 0이거나 n+1의 꼴인지를 구분하도록 경우를 구분하는 것으로 시작합니다.

source: When the equation compiler encounters a recursive definition, it first tries structural recursion, and only when that fails, does it fall back on well-founded recursion.
ko: 방정식 컴파일러가 재귀적 정의를 만날 때, 는 처음 구조적 재귀를 시도하고 그게 실패했을 때 잘 세워진 재귀로 대체됩니다.

source: When the goal can be inferred, we can also ask Lean instead to fill in the proof by writing by assumption:
ko: 목표가 추론될 수 있을 때, 우리는 by assumption을 써 증명을 채우는 대신 린에게 물어볼 수도 있습니다.

source: When the inductive type is specified to land in Prop, there are no constraints on the universe levels of the constructor arguments.
ko: 귀납형이 Prop에서 머무른다고 명시되어 있을 때, 생성자 인수의 세계 수준에 대한 제한이 없습니다.

source: When the section is closed, the variables go out of scope, and cannot be referenced any more.
ko: 섹션이 닫히게 될 때, 변수들은 범위를 벗어나게 됩니다. 그리고 구분된 메모리 외에 아무것도 없게 됩니다.

source: When the value of β depends on a (as does, for example, the expression β a in the previous paragraph), (a : α) → β denotes a dependent function type.
ko: β의 값이 a에 의존할 때(예를 들어 앞 단락에서 식 β a처럼), (a : α) → β는 의존적 함수 유형을 나타냅니다.

source: When they don't, the latter is always available as a backup.
ko: 그들이 동작하지 않을 때 후자는 백업으로 항상 사용할 수 있습니다.

source: When they work, they provide a much more convenient way of defining functions than using WellFounded.fix manually.
ko: 그들이 동작할 때, 그들은 수동적으로 WellFounded.fix를 사용하는 것보다 함수를 정의하는 훨씬 더 편리한 방법을 제공합니다.

source: When we define a structure using this command, Lean automatically generates all the projection functions.
ko: 우리가 이 명령을 사용해 구조체를 정의할 때, 린은 자동적으로 모든 투영함수를 생성합니다.

source: When we generalize t1 in such a way, we can then apply it to different pairs of propositions, to obtain different instances of the general theorem.
ko: 우리가 t1을 그런 식으로 일반화할 때, 그럼 우리는 일반 정리의 다른 예를 얻기 위해 다른 명제쌍에 대해서도 적용할 수 있습니다.

source: When we instantiate trans_r at the values a b c, we end up with a proof of r a b → r b c → r a c.
ko: 우리가 trans_r을 값 a b c에 대해 개체화할 때, 우리는 r a b → r b c → r a c의 증명을 갖게됩니다.

source: When we open a namespace, an identifier may be ambiguous.
ko: 우리가 이름공간을 열때, 식별자는 모호하다고 할 지 모릅니다.

source: When writing programs or formalizing mathematics, it is not uncommon to define structures containing many fields.
ko: 프로그램을 작성하거나 수학을 공식화할 때 만은 필드를 포함한 구조체를 정의하는 것은 흔합니다.

source: When you declare that you are working in the namespace Foo, every identifier you declare has a full name with prefix "Foo.".
ko: 이름공간 Foo에서 작업한다고 여러분이 선언할 때 여러분이 선언한 모든 식별자들은 "Foo."를 접미사로 갖습니다.

source: Whereas rewrite is designed as a surgical tool for manipulating a goal, the simplifier offers a more powerful form of automation.
ko: 반면 rewrite는 목표를 조작하기 위한 외과 수술 도구로써 고안되었습다. 단순화기는 자동화의 더욱 강력한 형태를 제공합니다.

source: While introducing new notations is a relatively rare feature in programming languages and sometimes even frowned upon because of its potential to obscure code, it is an invaluable tool in formalization for expressing established conventions and notations of the respective field succinctly in code.
ko: 새로운 기호를 도입하는 것은 프로그래밍 언어에서 상대적으로 흔치 않은 특징이고 때떄로는 그것이 잠재적으로 코드를 모호하게 하여 종종 난처하게 함에도 이는 세워진 관행들과 각 분야의 기호를 코드에서 간결하게 표현하는 것에 대한 형식화에 있어서 귀중한 도구입니다.

source: Wildcards and Overlapping Patterns
ko: 와일드카드와 중복되는 패턴

source: With calc, we can write the proof in the last section in a more natural and perspicuous way.
ko: calc를 통해서 우리는 지난 섹션에서 증명을 더 자연스럽고 안목있는 방식으로 작성할 수 있었습니다.

source: With the analogy, however, the proof we have just constructed is similar to a function that swaps the elements of a pair.
ko: 하지만 이 비유에도 우리가 막 만든 증명은 순서쌍의 원소를 바꾸는 함수와 비슷합니다.

source: With the classical axioms, we can prove that every proposition is decidable.
ko: 고전적 공리로 우리는 모든 명제가 결정 가능임을 증명할 수 있습니다.

source: With the propositions as types correspondence, logical connectives are also instances of inductive types, and so we tend to use dot notation for them as well:
ko: 유형으로써 명제 대응에서 논리 결합자도 귀납형의 개체들입니다. 그리고 그들에 대해서도 점 표기를 사용하는 경향이 있습니다.

source: With the three identities mentioned above, this has the effect that all the parentheses in an expression are associated to the right, and the expressions are ordered in a canonical (though somewhat arbitrary) way.
ko: 세 항등식이 위에서 언급되었는데 이들은 표현식에서 모든 괄호가 오른쪽으로 결합된다는 효과를 갖고 표현식들은 표준 방식(약간 임의적일지라도)에서 순서화됩니다.

source: With these tactics, an example from the previous section can be rewritten as follows:
ko: 이 전략으로 이전 섹션의 예제를 다음과 같이 다시 쓸 수 있습니다.

source: With this added to the earlier instance declarations, type class instance can infer, for example, a default element of Nat × Bool:
ko: 더 이전에 개체 선언에 이것을 추가하여 유형 클래스 개체는 예를 들어 Nat × Bool의 기본 원소를 추론할 수 있습니다.

source: With this annotation, the expression f 7 would be parsed as is, whereas f 7 3 would be parsed as f 7 _ 3, just as it would be with the strong annotation.
ko: 이 주석으로 표현식 f 7은 이대로 구문분석 될 수 있습니다. 반면 f 7 3은 강한 주석을 쓸 때처럼 f 7 _ 3으로 구문분석될 것입니다.

source: With this definition, one can construct an element of Tree α by giving an element of α together with a list of subtrees, possibly empty.
ko: 이 정의를 갖고 대게는 빈 하위 트리의 리스트와 α의 원소를 줌으로써 Tree α의 원소를 생성할 수 있습니다.

source: With this feature we can write compose as
ko: 이 기능으로 우리는 compose를 이와 같이 쓸 수 있습니다.

source: With this reduction, there are two ways that a computer can help establish a claim: it can help find a proof in the first place, and it can help verify that a purported proof is correct.
ko: 이러한 축소로부터 컴퓨터가 진술을 만드는데 도움을 주는 두 가지 방법이 있습니다. 처음부터 증명을 찾는 걸 돕는 것과 다른 하나는 제시한 증명이 옳은지 식별하도록 돕게 하는 것입니다.

source: Within the namespace, you can refer to identifiers by their shorter names, but once you end the namespace, you have to use the longer names.
ko: 이름공간 안에서 여러분은 식별자들을 그들의 약식 이름으로 부를 수 있습니다. 그러나 한번 이름공간에 끝에 오면 여러분은 더 긴 이름을 사용해야만 합니다.

source: Without classical logic, we cannot prove that every proposition is decidable.
ko: 고전 논리가 없으면 우리는 모든 명제가 결정 가능임을 증명할 수 없습니다.

source: Without the equation compiler, we would need a lot of boilerplate code to define very simple functions such as map, zip, and unzip using recursors.
ko: 방정식 컴파일러가 없다면 우리는 map, zip과 unzip같은 아주 단순한 함수를 재귀자를 사용해서 정의하려면 아주 많은 보일러 플레이트 코드가 필요할 것입니다.

source: Working with Propositions as Types
ko: 유형으로써 명제로 작업하기

source: Write a function that evaluates such an expression, evaluating each var n to v n.
ko: 각 var n을 v n으로 계산하는 표현식을 계산하는 함수를 작성하세요.

source: Writing suffices hq : q leaves us with two goals.
ko: suffices hq : q을 쓰는 것은 우리에게 두 목표를 남깁니다.

source: Writing simp only excludes these defaults, allowing you to use a more explicitly crafted list of rules.
ko: simp only를 쓰는 것은 여러분이 더 명시적으로 규칙 리스트를 만들어 사용하도록 하여 이런 기본설정을 배제합니다,

source: Yet again, the proofs can be compressed:
ko: 그러나 다시 이 증명은 간단히 될 수 있습니다.

source: You can then invoke this function using:
ko: 여러분은 이 함수를 다음과 같이 불러낼 수 있습니다.

source: You have already seen a nice example of this: the type List α depends on the argument α, and this dependence is what distinguishes List Nat and List Bool.
ko: 여러분은 이것에 대한 멋진 예제를 보았습니다. 유형 List α 는 인수 α에 의존합니다. 여기서 List Nat과 List Bool을 구분하는 것은 이 의존입니다.

source: You will see an example of this in a moment.
ko: 어느 때에 여러분은 이에 대한 예를 볼 것입니다.

source: You are encouraged to experiment with similar examples in the exercises below.
ko: 여러분은 아래 연습에서 비슷한 예제로 실험해보길 권유합니다.

source: You are now familiar with the fundamentals of dependent type theory, both as a language for defining mathematical objects and a language for constructing proofs.
ko: 정의한 수학적 대상과 증명을 만드는 언어 모두로써 여러분은 이제 기초적인 의존 유형론에 친숙합니다.

source: You can achieve that by marking it as a simplification rule when the theorem is defined:
ko: 여러분은 그것을 정리가 정의되었을 때 단순화 규칙으로 표시함으로써 달성할 수 있습니다.

source: You can enter these particular ones with \a, \b, and \g.
ko: 여러분은 이들 중 특정한 것은 \a, \b과 \g으로 입력할 수 있습니다.

source: You can then construct a proof by incrementally filling in these placeholders.
ko: 그럼 여러분은 이 자리 차지자들을 점차 재우는 것으로 증명을 구성할 수 있습니다.

source: You can use the command #eval to execute expressions, and it is the preferred way of testing your functions.
ko: 여러분은 #eval 명령을 사용해 식을 실행할 수 있습니다. 그리고 이것은 당신의 함수를 시험하는 선호되는 방식입니다.

source: You can "combine" intro h with match h ... and write the previous examples as follows
ko: 여러분은 intro h에 match h ...을 "결합"할 수 있고 이전 예제를 다음과 같이 썼습니다.

source: You can also avoid the parentheses around field names if you add a line break between each field.
ko: 여러분이 각 필드 사이에 줄 바꿈 문자를 추가하면 여러분은 필드 이름 주위에 괄호를 쓰지 않을 수 있습니다.

source: You can also declare new constants for types:
ko: 여러분은 유형들에 대해 새 상수를 선언할 수 있습니다.

source: You can also declare scoped instances in namespaces.
ko: 여러분은 이름공간에서 범위가 지정된 개체를 선언할 수 있습니다.

source: You can also define subst using match.
ko: 여러분도 match을 사용해 subst을 정의할 수 있습니다.

source: You can also define a function that takes another function as input.
ko: 여러분은 또 다른 함수를 입력으로 받는 함수를 정의할 수 있습니다.

source: You can also introduce auxiliary recursive declarations using where clause after your definition.
ko: 여러분도 부가적인 재귀 선언을 여러분의 정의 뒤에 where 절을 사용해서 도입할 수 있습니다.

source: You can also limit the search using the following options:
ko: 다음 옵션을 사용하여 검색을 제한할 수도 있습니다.

source: You can also pass types as parameters:
ko: 여러분은 매개변수로 유형도 전달할 수 있습니다.

source: You can also provide multiple alternatives like in the match expression.
ko: 여러분은 match 표현식에서처럼 여러 가지 변형들을 제공할 수도 있습니다.

source: You can also revert multiple elements of the context at once:
ko: 여러분은 맥락 속 다수의 요소들을 한번에 되돌려 놓을 수 있습니다.

source: You can also temporarily disable an instance using the attribute command until the current section or namespace is closed, or until the end of the current file.
ko: 여러분은 일시적으로 attribute 명령으로 현재 닫힌 section이나 namespace까지 혹은 현재 파일의 끝까지 개체를 사용 해제 할 수 있습니다.

source: You can also use cases with an arbitrary expression.
ko: 여러분은 임의의 표현식에 cases를 사용할 수도 있습니다.

source: You can also use let rec in tactic mode and for creating proofs by induction.
ko: 여러분도 전략 모드에서 귀납법으로 증명을 만들 때에 let rec을 사용할 수 있습니다.

source: You can also use match in tactic blocks.
ko: 여러분은 전략 블록에서 match 를 사용할 수 있습니다.

source: You can also use a (unstructured) cases without the with and a tactic for each alternative.
ko: 여러분은 (비구조화된)cases를 각각의 변형과 전략에 대해 with 없이 사용할 수 있습니다.

source: You can also use the ASCII alternative ->, so the expressions Nat -> Nat and Nat → Nat mean the same thing.
ko: 여러분은 ASCII 대체 표현으로 ->을 사용할 수 있습니다. 그래서 표현식 Nat -> Nat과 Nat → Nat은 같은 식을 의미합니다.

source: You can also use the rename_i tactic to rename the most recent inaccessible names in your context.
ko: 혹은 rename_i 전략으로 여러분의 상황에 가장 최근에 접속불가한 이름을 바꿀 수 있습니다.

source: You can also use the ascii equivalent, <-.
ko: 여러분은 아스키 등가 <-를 사용하는데 사용될 수 있습니다.

source: You can also use the auxiliary definition inferInstanceAs:
ko: 여러분은 부가 정의 inferInstanceAs도 사용할 수 있습니다.

source: You can also use the combinator tac1 <;> tac2 to apply tac2 to each subgoal produced by tactic tac1
ko: 또 여러분은 조합자 tac1 <;> tac2를 각각의 하위 목표가 만든 tac2에 tac1의 전략을 적용하여 사용할 수 있습니다.

source: You can also write the example above using match.
ko: 여러분은 match를 사용해 위의 예제를 쓸 수도 있습니다.

source: You can assign other priorities when defining an instance.
ko: 개체를 정의할 때 다른 우선 순위를 할당할 수 있습니다.

source: You can avoid the universe command by providing the universe parameters when defining compose.
ko: 여러분은 compose를 정의할 때 세계 매개변수를 제공하여 universe 명령을 피할 수 있습니다.

source: You can avoid the parentheses if you add a line break between each field.
ko: 여러분은 각 필드 사이에 줄바꿈 문자를 추가하면 괄호를 생략할 수 있습니다.

source: You can avoid the universe command by providing the universe parameters when defining F.
ko: 여러분은 F를 정의할 때 universe 매개변수를 제공하는 것으로 universe 명령을 쓰지 않을 수 있습니다.

source: You can change the order that type classes instances are tried by assigning them a priority.
ko: 유형 클래스 개체에 우선순위를 할당하여 그들이 시도되는 순서를 변경할 수 있습니다.

source: You can check that this definition of foo satisfies the same definitional identities as before.
ko: 여러분은 foo의 정의가 이전처럼 같은 정의 항등식을 만족하는 것을 확인할 수 있습니다.

source: You can combine multiple assignments by chaining let statements:
ko: 여러분은 다수의 할당을 let 구문으로 연결함으로써 결합할 수 있습니다.

source: You can combine the unstructured cases tactic with the case and . notation.
ko: 여러분은 비구조화된 cases 전략을 case와 . 기호와 결합할 수 있습니다.

source: You can declare a subterm inaccessible by writing .(t).
ko: 여러분은 .(t)와 같이 작성하여 접근불가한 부분항을 선언할 수 있습니다.

source: You can declare variables of any type, not just Type itself:
ko: 여러분은 Type 그 자체뿐만 아니라 임의의 유형의 변수를 선언할 수 있습니다.

source: You can define default instances with higher priority to override the builtin ones.
ko: 여러분은 내장된 것보다 우세하여 더 높은 우선순위를 갖는 기본 개체를 정의할 수 있습니다.

source: You can define local recursive declarations using the let rec keyword.
ko: 여러분은 지역적으로 재귀 선언을 let rec 키워드를 사용해 정의할 수 있습니다.

# You can enter the unicode arrow → by typing o or or ->.
source: You can enter the unicode arrow → by typing \to or \r or \->.
ko: 여러분은 유니코드 화살표 →를 \to을 치거나 or \r또는 \->으로 입력할 수 있습니다.

source: You can evaluate a lambda function by passing the required parameters:
ko: 여러분은 필요한 매개변수를 람다 함수에 넘겨줌으로써 값을 평가할 수 있습니다.

source: You can get a sense of how it works by looking at the types of Nat.below and Nat.brecOn:
ko: 여러분은 Nat.below과 Nat.brecOn의 유형을 봄으로써 이것이 어떻게 동작하는지에 대해 감을 얻을 수 있습니다.

source: You can import the classical axioms and make the generic instance of decidability available by opening the Classical namespace.
ko: Classical 이름공간을 여는 것으로 여러분은 고전적 공리를 불러올 수 있고 결정가능성의 일반적 개체를 만들 수 있습니다.

source: You can input the raw natural number 2 using the macro nat_lit 2.
ko: 여러분은 생 자연수 2를 매크로 nat_lit 2을 사용해 입력할 수 있습니다.

source: You can omit : Weekday when declaring the Weekday inductive type.
ko: 여러분은 귀납형 Weekday를 선언할 때 : Weekday을 생략할 수 있습니다.

source: You can omit the type declarations when Lean has enough information to infer it.
ko: Lean이 유형을 추론하기에 충분한 정보를 갖고있을 때 여러분은 유형 선언을 생략할 수 있습니다.

source: You can only revert an element of the local context, that is, a local variable or hypothesis.
ko: 여러분은 국부적인 상황 속 요소 즉, 지역변수나 가정을 revert 할 수 있습니다.

source: You can pass functions as parameters and by giving them names f and g you can then use those functions in the implementation:
ko: 여러분은 매개변수로 함수의 이름 f과 g 을 주는 것으로 함수를 전달할 수 있습니다. 그러면 구현에서 이들 함수를 사용할 수 있습니다.

source: You can probably guess what this one will do.
ko: 여러분은 이 정의가 아마 뭘 할 지 추측할 수 있을 거예요.

source: You can prove the theorem above in that way:
ko: 여러분은 위의 정리를 그와 같이 증명할 수 있습니다.

source: You can prove this by induction on m:
ko: 여러분은 이것을 m에 대한 귀납으로 증명할 수 있습니다.

source: You can provide different expansions, and the tactic interpreter will try all of them until one succeeds.
ko: 여러분은 다른 확장을 제공할 수 있다. 그리고 전략 해석기는 한 개가 성공할 때까지 그들 모두를 시도할 것이다.

source: You can see that each one of the expressions above is an object of type Type.
ko: 여러분도 보다시피 위 각각의 표현식은 Type 유형입니다.

source: You can see the contents of these directories and files using GitHub's browser interface.
ko: 여러분은 깃허브 브라우저 인터페이스로 이 디렉토리와 파일의 내용물을 볼 수 있습니다.

source: You can see the correct order in an editor by placing the cursor on the simp identifier to see the documentation string that is associated with it.
ko: 여려분은 이와 연관된 문서 끈을 보기 위해 simp 식별자에 커서를 놓아 편집기에서 옳은 순서를 볼 수 있습니다.

source: You can see the resulting proof term with the #print command:
ko: 여러분은 #print 명령으로 증명항의 결과를 볼 수 있습니다.

source: You can solve the subgoal right before left using the case notation
ko: 여러분은 case기호를 사용해서 하위목표 left보다 먼저 right을 풀 수 있습니다.

source: You can structure your tactics using the notation case <tag> => <tactics>.
ko: 여러분은 여러분의 전략을 case <tag> => <tactics>기호를 사용해 구조화할 수 있습니다.

source: You can then replace the sorry in the previous proof with succ_add.
ko: 그럼 여러분은 이전 증명에서 sorry를 succ_add으로 대체할 수 있습니다.

source: You can therefore proceed as though α, β, γ, g, f, h, and x are fixed objects when you write your definitions, and let Lean abstract the definitions for you automatically.
ko: 그러므로 여러분은 여러분의 정의를 작성할 때 α, β, γ, g, f, h, x가 고정된 대상임에도 사용할 수 있습니다. 그리고 lean이 여러분을 위해 자동으로 정의를 축약할 수 있게 합니다.

source: You can think of the inhabitant of p as being the "fact that p is true." A proof of p → q uses "the fact that p is true" to obtain "the fact that q is true."
ko: p의 머무름은 "p가 참이라는 사실"이라 생각할 수 있습니다. p → q의 증명은 "p가 참이라는 사실"을 "q이 참이라는 사실"을 얻기위해 사용합니다.

source: You can type things into the editor and modify the examples, and Lean will check the results and provide feedback continuously as you type.
ko: 여러분은 편집기에 무언가를 치거나 예제를 수정할 수 있습니다. 그리고 린은 여러분이 치는 동안 지속적으로 결과를 확인하고 피드백을 제공할 것입니다.

source: You can type these corner quotes using \f< and \f>, respectively.
ko: 여러분은 이런 인용 꺽쇠를 각각 \f<과 \f>을 사용해서 칠 수 있습니다.

source: You can use match to provide a proof of the claim for each constructor:
ko: 우리는 각 생성자에 대해 주장의 증명을 제공하기 위해 match를 사용할 수 있습니다.

source: You can use ⟨a, b⟩ or Sigma.mk a b to create a dependent pair.
ko: 여러분은 ⟨a, b⟩ 또는 Sigma.mk a b를 종속적 쌍을 만드는데 쓸 수 있습니다.

source: You can use a numeral (e.g., 2) to denote an element of any type that implements the type class OfNat.
ko: 여러분은 수치값(예를 들어 2)을 유형클래스 OfNat을 구현하는 임의의 유형의 원소를 표시하는데 사용할 수 있습니다.

source: You can use it to introduce several variables:
ko: 여러분은 몇 개의 변수들을 도입하는데 사용할 수 있습니다.

source: You can use other more interesting expressions inside a def:
ko: 여러분은 다른 더 흥미로운 식을 def 안에 사용할 수 있습니다.

source: You can use our new scalar array multiplication instance on arrays of type Array β with a scalar of type α whenever you have an instance HMul α β γ.
ko: 여러분은 HMul α β γ 개체를 갖는 언제든지 우리의 새 스칼라 배열 곱셈 개체를 유형 α의 스칼라와 Array β형의 배열에 대해 사용할 수 있습니다.

source: You can use the match notation in tactics too:
ko: 여러분은 전략에서 match 기호도 사용할 수 있습니다.

source: You can use the command #print to inspect how simple inferInstance is.
ko: 여러분은 #print 명령으로 inferInstance가 얼마나 단순한지 검사할 수 있습니다.

source: You can use the command export to create the alias default for Inhabited.default
ko: 여러분은 g1>export 명령으로 Inhabited.default에 대한 기본 별명을 만들 수 있습니다.

source: You can use the command open scoped <namespace> to activate scoped attributes but will not "open" the names from the namespace.
ko: 여러분은 open scoped <namespace> 명령으로 범위가 지정된 속정을 활성화할 수 있습니다. 그러나 이름공간으로부터 이름들을 "개방"하지는 않습니다.

source: You can view an element of the type ImageOf f b as evidence that b is in the image of f, whereby the constructor imf is used to build such evidence.
ko: 여러분은 ImageOf f b형 원소를 b가 f의 이미지에 있다는 증거로 볼 수 있습니다. 이로써 생성자 imf는 그런 증거를 만드는데 사용됩니다.

source: You can view the parameter of the type class Inhabited as an input value for the type class synthesizer.
ko: 여러분은 유형 클래스 합성기에 대한 입력값으로써 유형 클래스 Inhabited의 매개변수를 볼 수 있습니다.

source: You can write #print sub2 to see how the function was compiled to recursors.
ko: 여러분은 #print sub2를 써 어떻게 함수가 재귀자로부터 컴파일되었는지 볼 수 있습니다.

source: You can write a tactic script incrementally.
ko: 여러분은 점진적으로 전략 스크립트를 쓸 수도 있습니다.

source: You can write this goal as follows:
ko: 여러분은 이 목표를 다음과 같이 쓸 수 있습니다.

source: You can, in general, leave off the type annotation and let Lean infer it for you.
ko: 일반적으로 여러분도 유형 표기를 빼고 린에게 유형을 추론하게 둘 수 있습니다.

source: You do not have to indent the lines within a section.
ko: 섹션 안에서 줄에 들여쓰기를 하거나

source: You have actually come up against one of the most subtle aspects of Lean's typing system.
ko: 여러분은 린의 유형화 시스템의 가장 미묘한 면 중 하나를 마주쳤습니다.

source: You have already seen the introduction rules for an inductive type: they are just the constructors that are specified in the definition of the type.
ko: 여러분은 귀납형에 대한 도입규칙을 이미 봤었습니다. 그들은 그저 유형의 정의에서 명시된 생성자들일 뿐입니다.

source: You have already seen two of the most common ones, #check and #eval.
ko: 여러분은 가장 흔한 것 중 두 개인 #check과 #eval를 봤습니다.

source: You have seen that if you have m : Nat and n : Nat, then (m, n) denotes the ordered pair of m and n which is of type Nat × Nat.
ko: 여러분은 m : Nat과 n : Nat이면, (m, n)은 Nat × Nat유형인 m과 n의 순서쌍을 가리킨다는 것을 보았습니다.

source: You have to remember that the second argument to div.F, the recipe for the recursion, is a function that is supposed to return the divide by y function for all values x₁ smaller than x.
ko: 여러분은 재귀를 위한 요리법인 div.F의 두 번째 인수가 x보다 작은 모든 x₁값에 대한 y 함수로 나눠진 것을 반환하기로 한 함수임을 기억해야만 합니다.

source: You implement the instance for your own types and use chaining to convert complex values into strings.
ko: 여러분은 여러분의 유형을 위한 개체를 구현하고 문자열로 복잡한 값에서 문자열로 연결하기를 사용합니다.

source: You may also provide the value for an implicit parameter when Lean failed to infer it.
ko: 여러분은 린이 그것에 대해 추론을 실패했을 때 암시적인 매개변수에 대한 값을 제공할 수도 있습니다.

source: You saw in Variables and Sections that the section command makes it possible not only to group together elements of a theory that go together, but also to declare variables that are inserted as arguments to theorems and definitions, as necessary.
ko: 여러분은 Variables and Sections에서 section 명령으로 필요하다면 함께 할 이론의 요소를 한데 묶을 수 있을 뿐만 아니라 정리와 정의에 인수로 삽입될 변수를 선언할 수도 있습니다.

source: You should also try to understand why the reverse implication is not derivable in the last example.
ko: 여러분은 왜 명제의 역이 마지막 예제에서 불가능한지 이해하려고 시도해봐야 합니다.

source: You should get 47 here.
ko: 여러분은 여기서 47을 얻어야 합니다.

source: You should think about how these give rise to the introduction and elimination rules that you have already seen.
ko: 여러분은 이것이 어떻게 여러분이 이미 봐온 도입과 제거 규칙을 제공하는지에 대해 생각해봐야 합니다.

source: You should try declaring some constants and type checking some expressions on your own.
ko: 여러분은 스스로 몇몇 상수를 선언하고 몇 가지 식의 유형을 확인해보길 바랍니다.

source: You will generally use lower-case Greek letters like α, β, and γ to range over types.
ko: 여러분은 유형을 포괄하기 위해 α, β, γ같은 그리스 소문자 자주 사용할 것입니다.

source: You will have no doubt noticed by now that tactics can fail.
ko: 여러분은 이제 의심의 여지없이 전략은 실패할 것임을 눈치챌 것입니다.
